# ParameterId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchedulableField..::..ParameterId Property
SchedulableField Class See Also
---
The ID of the parameter displayed by the field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ParameterId { get; set; }
```

Visual Basic
---
```text
Public Property ParameterId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ParameterId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# ### Field Value
The parameter ID, or InvalidElementId.
# Remarks
Most non-calculated field types require a parameter ID. The Count field doesn't have a parameter ID.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SchedulableField Class
Autodesk.Revit.DB Namespace